{
  "programObjective": [
    {
      "id": 1,
      "symbol": "PO - 1.2",
      "content": "- Vận dụng được các kiến thức thuyết trình, giao tiếp, làm việc nhóm trong công tác chuyên môn.\n- Hiểu biết cơ bản về pháp luật Việt Nam, sự phân chia các ngành luật và tổ chức của Nhà nước Việt Nam hiện nay\n- Hiểu biết và vận dụng được các kiến thức cơ bản về môi trường vào việc giữ gìn và bảo vệ môi trường",
      "type": "KIEN_THUC",
      "programId": 1
    },
    {
      "id": 2,
      "symbol": "PO - 2.1",
      "content": "- Có kỹ năng sử dụng thành thạo các phần mềm, công cụ, ngôn ngữ lập trình và công nghệ để thực hiện các nghiệp vụ liên quan đến lĩnh vực Công nghệ thông tin\n- Có kỹ năng vận dụng được các qui trình phân tích, thiết kế, xây dựng, kiểm thử đối với các hệ thống phần mềm;\n- Có kỹ năng vận dụng các kiến thức cơ bản về Toán trong khoa học công nghệ;",
      "type": "KY_NANG",
      "programId": 1
    },
    {
      "id": 3,
      "symbol": "PO - 1.1",
      "content": "- Có kiến thức về giáo dục thể chất, An ninh quốc phòng và vận dụng được kiến thức về thế giới quan, nhân sinh quan và phương pháp luận của Chủ nghĩa Mác-Lênin, tư tưởng Hồ Chí Minh, các quan điểm, đường lối của Đảng Cộng sản Việt Nam vào cuộc sống.\n- Giao tiếp tốt bằng ngoại ngữ trong các tình huống thông thường; viết, trình bày báo cáo chuyên môn trong công việc bằng ngoại ngữ",
      "type": "KIEN_THUC",
      "programId": 1
    },
    {
      "id": 4,
      "symbol": "PO - 2.2",
      "content": "- Có kỹ năng tìm kiếm, cập nhật, tổng hợp, khai thác thông tin; Có kỹ năng giao tiếp và làm việc nhóm, thiết kế và phát triển phần mềm máy tính; thiết kế, lắp đặt và quản lý hệ thống thông tin",
      "type": "KY_NANG",
      "programId": 1
    },
    {
      "id": 5,
      "symbol": "PO - 3.2",
      "content": "- Có khả năng tự định hướng, thích nghi với môi trường làm việc khác nhau; tự học tập, tích lũy kiến thức, kinh nghiệm để nâng cao trình độ chuyên môn nghiệp vụ.",
      "type": "THAI_DO",
      "programId": 1
    },
    {
      "id": 6,
      "symbol": "PO - 3.1",
      "content": "- Có phẩm chất đạo đức tốt, có ý thức tổ chức kỷ luật, có thái độ hợp tác với đồng nghiệp, tôn trọng pháp luật và qui định nơi làm việc, trung thực và có tính kỷ luật cao, sẵn sàng đảm nhiệm các công việc được giao nơi làm việc.",
      "type": "THAI_DO",
      "programId": 1
    },
    {
      "id": 7,
      "symbol": "PO - 2.3",
      "content": "- Có kỹ năng lập luận tư duy và giải quyết vấn đề: Có kỹ năng phát hiện vấn đề; Có kỹ năng đánh giá và phân tích vấn đề; Có kỹ năng giải quyết vấn đề chuyên môn; Có kỹ năng mô hình hóa; …",
      "type": "KY_NANG",
      "programId": 1
    },
    {
      "id": 8,
      "programId": 1,
      "symbol": "PO - 1.3",
      "content": "3",
      "type": "KIEN_THUC"
    },
    {
      "id": 11,
      "programId": 1,
      "symbol": "PO - 1.4",
      "content": "5",
      "type": "KIEN_THUC"
    }
  ]
}